<a href="https://colab.research.google.com/github/MaxTechniche/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/Jacob_Maxfield_LS_DS20_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [2]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-09-02 20:17:46--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.112.77
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.112.77|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’

instacart_online_gr 100%[===================>] 196.03M  16.6MB/s    in 13s

2020-09-02 20:18:00 (15.0 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’ saved [205548478/205548478]

In [3]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [4]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [5]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [6]:
##### YOUR CODE HERE #####
"""
I need:
product_name
product_id
"""

# checking which datasets have what i need
# !head aisles.csv -                                              Nope
# !head departments.csv -                                         Nope
# !head order_products__prior.csv - Has product_id.               Yes
# !head order_products__train.csv - Same as other order products. Yes
# !head orders.csv -                                              Nope
# !head products.csv - Has product_name and product_id.           Yes

'\nI need:\nproduct_name\nproduct_id\n'

In [7]:
# Import needed modules
import pandas as pd

# Concatting order_product DataFrames
order_products = pd.concat([pd.read_csv('order_products__prior.csv'),
                           pd.read_csv('order_products__train.csv')])
# Make sure everything looks good
order_products.shape

(33819106, 4)

In [8]:
# Quick look at head and tail
order_products

         order_id  product_id  add_to_cart_order  reordered
0               2       33120                  1          1
1               2       28985                  2          1
2               2        9327                  3          0
3               2       45918                  4          1
4               2       30035                  5          0
...           ...         ...                ...        ...
1384612   3421063       14233                  3          1
1384613   3421063       35548                  4          1
1384614   3421070       35951                  1          1
1384615   3421070       16953                  2          1
1384616   3421070        4724                  3          1

[33819106 rows x 4 columns]

In [9]:
# verifying tail of order_products__train
!tail order_products__train.csv

3421058,30316,6,1
3421058,35578,7,0
3421058,32650,8,1
3421063,49235,1,1
3421063,13565,2,1
3421063,14233,3,1
3421063,35548,4,1
3421070,35951,1,1
3421070,16953,2,1
3421070,4724,3,1

Looks good!

In [10]:
# Now for the products table
# loading in products.csv
products = pd.read_csv('products.csv')

# Quick look
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [11]:
# Removing columns I don't need from the products dataframe
products = products.drop(columns=['aisle_id', 'department_id'])
print(products.shape)
products.head()

(49688, 2)

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [12]:
# Same for order_products dataframe
product_order_ids = order_products.drop(columns=['add_to_cart_order', 'reordered', 'order_id'])
product_order_ids.head()

   product_id
0       33120
1       28985
2        9327
3       45918
4       30035

In [13]:
# Merging the product names with the product orders
product_order_counts = pd.merge(products, product_order_ids, how='outer')
product_order_counts.head()

   product_id                product_name
0           1  Chocolate Sandwich Cookies
1           1  Chocolate Sandwich Cookies
2           1  Chocolate Sandwich Cookies
3           1  Chocolate Sandwich Cookies
4           1  Chocolate Sandwich Cookies

In [14]:
# I can display the top 10 values by doing this
top10 = product_order_counts['product_name'].value_counts().head(10)
top10

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [16]:
# BUT I want to add it to what's already there
# So I create a DataFrame from the value_counts
product_counts = product_order_counts['product_name'].value_counts().rename_axis('product_name').reset_index(name='counts')
product_counts.head()

             product_name  counts
0                  Banana  491291
1  Bag of Organic Bananas  394930
2    Organic Strawberries  275577
3    Organic Baby Spinach  251705
4    Organic Hass Avocado  220877

In [17]:
# Because I now know how orders of each product there are
# I can drop each duplicate from the dataframe
product_order_counts = product_order_counts.drop_duplicates()
product_order_counts.head()

      product_id                                       product_name
0              1                         Chocolate Sandwich Cookies
1928           2                                   All-Seasons Salt
2022           3               Robust Golden Unsweetened Oolong Tea
2305           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
2656           5                          Green Chile Anytime Sauce

In [18]:
# Then I merge the two dataframes to create one that has
# the product_id, the product_name, and the count
product_order_counts_testing = pd.merge(product_order_counts, product_counts, how='inner')
# Printing out the first 10 after sorting
product_order_counts_testing.sort_values(by='counts', ascending=False).head(10)

       product_id            product_name  counts
24851       24852                  Banana  491291
13175       13176  Bag of Organic Bananas  394930
21136       21137    Organic Strawberries  275577
21902       21903    Organic Baby Spinach  251705
47208       47209    Organic Hass Avocado  220877
47765       47766         Organic Avocado  184224
47625       47626             Large Lemon  160792
16796       16797            Strawberries  149445
26208       26209                   Limes  146660
27844       27845      Organic Whole Milk  142813

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [ ]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [ ]:
# table2 -> tidy

In [ ]:
# tidy -> table2

In [ ]:
flights = sns.load_dataset('flights')

In [ ]:
# Flights Pivot Table

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [ ]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####